sdaiRenameSchemaInstanceBN(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Renames a specified schema instance.
\param schemaInstOldName [in] A string that contains the old name of the schema instance to be renamed.
\param repository        [in] A repository where the function searches the schema instance by the specified name.
\param schemaInstName    [in] A new name of the schema instance.